[
    {
      "title": "TFE: TattooExplore",
      "titleShort": "TattooExplore",
      "urlSite": "https://antoni-dumont.be/projets/tfe/",
      "sub1": "Un art pour un voyage",
      "txt1": ["Pourquoi ce sujet ? Juste pour une envie de partager sur une passion qui m'accompagne depuis des années qui m'a permis de développer mes aptitudes et mon imaginaire dans le monde de l'illustration. Mais comment je voulais repenser cet univers pour le proposer à un grand monde qui n'avait pas les connaissances et qu'il fallait intéresser, intriguer et donner envie d'en apprendre plus une fois sorti de ce site.","J'ai opté pour une expérience visuelle, narrative autour de l'histoire du tatouage, plus précisément des différents styles qui le composent. Mais comment les relier entre eux ? car on parle de style qui se trouve sur des zones géographiques sur terre .... L'idée simple mais intéressante m'est venue de présenter ça comme un voyage, un road-trip dans les différents pays du monde pour découvrir l'histoire des tattoos."],
      "img1": "",
      "sub2": "La conception de cet univers",
      "txt2": ["Dès lors j'ai commencé à réfléchir à comment le réaliser, une fois mes recherches, documentations et écritures des différentes parties faites.","Pour la création de mon projet, je voulais sortir de ma zone de confort et faire ce projet en React, car j'avais réfléchi mon design en composant ( en fonction de leur niveau, il aurait un ou plusieur usage) qui serait facilement utilisable mais aussi simplement transformable pour chaque partie et leur subtilité. En plus de cela, j'ai utilisé une librairie spécialisée dans la conception d'animation pour react ( Framer motion) pour ajouter ce mouvement, les fait d'ajouter une touche de vie à ce projet."],
      "img2": "",
      "img3": "",
      "sub3": "La patte graphique pour tous ",
      "txt3": "Par l'autre sujet fort, la partie graphique & UI/UX, j'ai voulu partir sur une recherche graphique qui ferait ressortir ce côté sombre, sale qu'a pu avoir le tatouage mais tout en mettant en avant les photographies qui sont un point central dans ce projet. Car c'est ce qui attire le plus l'œil et c'est ce qu'on s'attend à voir quand on regarde des tattoos. Ainsi j'ai construit mon site en faisant en sorte que l'utilisateur puisse suivre un chemin simple, mais en lui mettant du changement dans son déroulement, pour briser une monotonie & pour raviver le côté curiosité qu'on a tous en nous. J'ai aussi travaillé sur une pallette de couleur / font qui permettait à tous et à chacun d'utiliser ce site, car l'accessibilité est un point important auquel j'ai travaillé mais sans tomber dans les travers du simplisme ( où on bride la créativité pour être bon pour tous).",
      "conclusion": "Dès lors, avec toutes ses péripéties, des ouragans et des rebondissements. Ce projet à fini par voir le jour et qui sait s'il ne continuera pas dans une autre vie.",
      "tag1": "TFE",
      "tag2": "Scolaire",
      "year": 2023
    },
    {
      "title": "Archeo: Web basement 2023",
      "titleShort": "Archeo",
      "urlSite": "http://antoni-dumont.be/projets/wb/",
      "sub1": "La genèse de ce projet :",
      "txt1": ["Il est né pendant un défi, organisé par l’option Design Web Transmédia de la HEAJ, pour s’amuser et créer autour d’un énoncé tout aussi abstrait que complètement loufoque. Avec mon équipe de choc Bastien Thunus & Jean De Roy, nous avons relever ce défis et nous sommes partis ) la conquête de ce thèmes qui fut : futur, passé, présent, vous devez vous situer dans le temps pour montrer des intéractions du passé avec le futur qui sont visible dans le présent mais qui on put changer le cours du passé par les actions du futur."],
      "img1": "",
      "sub2": "Ma partie, le dev : ",
      "txt2": ["Comme pour nombreux projets, j'ai laissé le design à Bastien, et je me suis concentré sur la création du projet, avec une vision mobile first et une réutilisation des contenus comme on partait pour une sorte de blog. Ainsi j’ai pris la décision de faire un projet react, pour la simplicité et le côté “ une fois la base faite, il y a plus que les datas qui changent”, comme le temps nous était compté comme on participait à une autre activité annexe."],
      "img2": "",
      "img3": "",
      "sub3": "",
      "txt3": ["Les points noir, on été de rendre la création graphique telle qu’elle était sur figma, même si de primes abord, la simplicité prime c’est dans les détails que ce projet fut un peux plus sérré, car avec les différents jeux de supperpostions avec des même éléments, un comportement responsive à gérer, des tailles à respecter pour garder les harmonies. On peut dire que l’amusement était là et que la création fut fun et bien sympathique."],
      "conclusion": "Ce fut un projet bien fun, avec un travail d’équipe répartit et une expérience aussi dans l’intégration de ce genre de design. Une bulle d’oxygène dans un océan de créativité.",
      "tag1": "WebBasement",
      "tag2": "Fun",
      "year": 2023
    },
    {
      "title": "La Chatterie du Monde de Gioia",
      "titleShort": "CMG",
      "urlSite": "https://chatterie-monde-de-gioia.vercel.app/",
      "sub1": "Mon premier projet client",
      "txt1": ["Comme pour la création de bon nombre de projets, et pour avoir du contenu dans mon portfolio, je suis parti à la recherche de clients. Mais je me suis vite arrêté sur la Chatterie Du Monde de Gioia, appartenant à un membre de la famille, c’est une bonne expérience pour commencer à travailler hors du cadre que j’ai toujours eux. ","Donc l’objectif était simple, un site pour présenter la chatterie, les chat et chatons mais en mettant en avant les nouvelles réglementations. Le tout dans des tons gris / bleu avec un design simple."],
      "img1": "",
      "sub2": "La veille & la conception du design :",
      "txt2": "[{“Pour comprendre un peux le marché et ce que font les autres éleveurs, j’ai travaillé en faisant une analyse des sites concurrent ( comment il structurait les informations sur les chats, les chatons, présentations des titres, pedigree ..) mais aussi sur les données importantes à faire valoir pour montrer qu’on est belle et bien agréé. “}, {“Après cette audit, je me suis lancé dans un moodboard avec différents éléments graphique comme des sites, des poster, des compos, des couleurs et j’en ai ressorti une charte graphique avec les fontes, où l’utilisation d’une fonts, un peu plus organique, avec un jeu sur la queue de certaines lettre mettait en avant le fait de penser à un chat. “}]",
      "img2": "",
      "img3": "",
      "sub3": "La construction, avec Next : ",
      "txt3": ["Pour le développement, j’ai voulu tester “l’enfant” de react, comme le site serait maintenus en permanence par moi, j’ai choisi cette alternative pour avoir un projet tennant avec. L'apprentissage des différences avec react et son système de fonctionnement, ayant été vite fait, je me suis mis dans la réalisation de ce projet en mobile first, comme la plus grande utilisation se ferait sur téléphone ( du au lien sur les cartes de visites et sur les réseaux sociaux ). La création fut assez simple, comme le design, dans un style d’inspiration brutaliste, m’a permis de faire des jeux de compositions avec les différents éléments tout en proposant une création qui est fonctionnelle dans tous les environnements. "],
      "conclusion": "Ainsi le projet est né, mon premier projet client est en ligne et m’a permis d’en apprendre un peu plus sur la gestion de ce genre de projet en solo. ",
      "tag1": "Chat",
      "tag2": "Client",
      "year": 2023
    },
    {
      "title": "BMW old experience",
      "titleShort": "BMW Old",
      "urlSite": "https://www.figma.com/proto/VxyHNWk1pmoM6BgjiH774t/BMW-M-experience?page-id=1%3A4&type=design&node-id=23-87&viewport=-154%2C578%2C0.21&t=JY6E8PVdR3DSyLTd-1&scaling=scale-down&starting-point-node-id=23%3A87&mode=design",
      "sub1": "La passion des ancètres :",
      "txt1": ["Ce projet est né après que je me sois lancé le défi de faire un triptyque d'affiches pour 3 anciennes BMW M. Une des marques que j'appréciais pour leur beauté mais aussi pour leur vivacité et leur conduite. J’ai voulu concevoir un écrin qui mettrait en avant les affiches mais en passant par la découverte de la naissance de cette marque mythique. Avec une expérience, qui je l’espère sera au rendez-vous, je me suis donné un temps relativement long ( 5 mois , travail après le boulot + wk) pour fournir ma première expériences au scroll correct. Mais pour ça il me fallait un design. "],
      "img1": "",
      "sub2": "Le design, entre classe et folie : ",
      "txt2": ["Je souhaitais créer une expérience dynamique, comme pour le logo M, les 3 barres donnent ce mouvement dans la stabilité. C’est de cette impression que je veux avancer pour créer un site qui aura du mouvement même dans la stabilité, où la vie viendra dans le scroll et ce mouvement sera imprimé après le passage pour marquer un changement.","Graphiquement parlant, je suis resté dans la basique dans les couleurs pour repartir de celles de BMW M mais en rajoutant un beige clair pour poser tous les éléments et donné un côté vieux. Avec l’utilisation d’une font brush, pour donner ce côté street et qui vient recouvrir les espaces, comme le ferait un graffeur."],
      "img2": "",
      "img3": "",
      "sub3": "",
      "txt3": ["C’est en mélangeant tous ces aspects que j’ai pris le parti de concevoir quelque chose qui relierait les poster ( avec l’art du graff) à la classe et ce côté droit des design allemand. Dès lors, après plusieurs essais j’ai fini par valider ce design final, pour avoir une vision du passage du Monstre."],
      "conclusion": "Comme ce projet est toujours dans l’usine, je ne peux que vous fournir le visuel de ce qu’il sera. Mais a très bientôt pour le voir accomplie.",
      "tag1": "En cours",
      "tag2": "Fun",
      "year": 2024
    },

    {
      "title": "Image to ASCII",
      "titleShort": "ASCII",
      "urlSite": "https://github.com/antozr/ascii",
      "sub1": "Un problème, une solution : ",
      "txt1": ["Pour faire simple, pendant mon stage je devais transformer des images en en image ASCII, j’ai utilisé plusieurs sites pour le faire et j’ai vus que chacun avait ses petites spécificités mais que globalement c’était la même chose. Donc j’ai voulu le refaire mais en .py car j’avais envie d’apprendre ( et je voulais pas passer par une interface mais juste la console au début). "],
      "img1": "",
      "sub2": "La création de mon ASCII transforme ",
      "txt2": ["J’ai regardé plusieurs tuto, ainsi que des posts sur Stackoverflow afin d’avoir une base de comment l’image est découpé, comment on synthétise les pixel de couleur en valeurs textuels. Une fois toutes ses infos en ma possessions j’ai pu réaliser mes premiers test, conclusions ça fonctionnait mais j’avais d’autre besoin."],
      "img2": "",
      "img3": "",
      "sub3": "",
      "txt3": ["Je devais ajouter un paramètre pour savoir si je voulais sortir le fichier .txt, .html ou en jpeg. Donc j’ai modifié mon code pour ajouter ses différentes fonctionnalités afin de créer un programme qui soit le plus optimales possibles. Même s’il devrait encore être perfectionné, il a le mérite de fonctionner . "],
      "conclusion": "Avec un peu de temps et des recherches, j’ai pu combler mon savoir et faire ce que je voulais. ",
      "tag1": "Python",
      "tag2": "Fun",
      "year": 2023
    },
    {
      "title": "OXO ou morpion ?",
      "titleShort": "OXO",
      "urlSite": "https://github.com/antozr/oxoGame",
      "sub1": "Un apprentissage en free-solo : ",
      "txt1": ["J’ai décidé d’apprendre le python, mais comme suivre des formations c’est long, je préfère me lancer des défis qui me feront atteindre les limites de mes connaissances dans le .py et me donner accès à de nouvelles connaissances. Ce que j’ai fait avec ce jeux du OXO avec l’ordinateur ( qui a subi des évolutions tout au long du jeu). "],
      "img1": "",
      "sub2": "Les bases des bases : ",
      "txt2": ["Les règles sont simples : 9 cases, 2 joueurs et le premier qui aligne ces 3 symboles gagne. C'est ce que j’ai commencé à faire en étant des principes de bases simples à appliquer. Tout se fait par la console, dont je fais une impression dedans, avec une boucle pour que la console continue d’afficher à chaque tour le nouveau plateau jusqu’à un des deux gagne ou bien avec une égalité. "],
      "img2": "",
      "img3": "",
      "sub3": "Un côté intelligent pour la machine : ",
      "txt3": ["Jusqu’à maintenant la machine faisait ses choix de façon aléatoire, mais j’ai voulu lui rajouter une ‘intelligence’ pour qu’elle fasse ses choix en fonction de la place de ses pions, des pions restants et du joueurs . Pour se faire, je fais passer son choix dans une fonction d'analyse du plateau qui vérifie si son choix est justifié ou pas. Et de la on j’ai pus avoir un jeu un peux plus complexifier avec le robot. "],
      "conclusion": "Ce projet étant le premier que j’ai avancé bien au-delà de mes espérances de départ et qui m'a permis d’apprendre encore plus sur le .py. ",
      "tag1": "Python",
      "tag2": "Fun",
      "year": 2022
    }

  ]